Exercises I
Run python -m pip install mysqlclient pymysql from your terminal to install pymysql and the mysqlclient.

Create a notebook or python script named advanced_dataframes to do your work in for these exercises.

In [1]:
import pandas as pd
import numpy as np
from pydataset import data

In [2]:
from env import host, user, password
url = f'mysql+pymysql://{user}:{password}@{host}/employees'

1. Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

In [3]:
def get_db_url(db, user=user, host=host, password=password):
    return f'mysql+pymysql://{user}:{password}@{host}/{db}'

2. Use your function to obtain a connection to the employees database.

In [9]:
url = get_db_url('employees', user, host, password)

In [10]:
sql_query = 'SELECT * FROM employees'

pandas.core.frame.DataFrame

In [12]:
def get_employees_data(db):
    return pd.read_sql(sql_query, get_db_url(db))

In [13]:
get_employees_data('employees')

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

3. Once you have successfully run a query:

a. Intentionally make a typo in the database url. What kind of error message do you see?

b. Intentionally make an error in your SQL query. What does the error message look like?

4. Read the employees and titles tables into two separate DataFrames.

In [16]:
# create the employees DataFrame
employees_df = pd.read_sql('SELECT * FROM employees', url)
# create the titles DataDrame
titles_df = pd.read_sql('SELECT * FROM titles', url)

5. How many rows and columns do you have in each DataFrame? Is that what you expected?

In [17]:
# shape of employees_df
employees_df.shape

(300024, 6)

In [18]:
# shape of titles_df
titles_df.shape

(443308, 4)

6. Display the summary statistics for each DataFrame.

In [19]:
# what does employees_df look like / contain?
employees_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   emp_no      300024 non-null  int64
 1   birth_date  300024 non-null  object
 2   first_name  300024 non-null  object
 3   last_name   300024 non-null  object
 4   gender      300024 non-null  object
 5   hire_date   300024 non-null  object
dtypes: int64(1), object(5)
memory usage: 13.7+ MB

In [21]:
# how about titles?
titles_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     443308 non-null  int64
 1   title      443308 non-null  object
 2   from_date  443308 non-null  object
 3   to_date    443308 non-null  object
dtypes: int64(1), object(3)
memory usage: 13.5+ MB

7. How many unique titles are in the titles DataFrame?

In [23]:
# let's find the title column in the titles_df
titles_df['title'].head

<bound method NDFrame.head of 0         Senior Engineer
1                   Staff
2         Senior Engineer
3                Engineer
4         Senior Engineer
               ...
443303           Engineer
443304    Senior Engineer
443305       Senior Staff
443306              Staff
443307           Engineer
Name: title, Length: 443308, dtype: object>

In [25]:
# now let's find the unique titles
titles_df['title'].unique()

array(['Senior Engineer', 'Staff', 'Engineer', 'Senior Staff',
       'Assistant Engineer', 'Technique Leader', 'Manager'], dtype=object)

In [26]:
# how many is that?
titles_df['title'].nunique()

7

8. What is the oldest date in the to_date column?

In [33]:
# let's find the to_date column in the titles_df and sort it
titles_df['to_date'].sort_values().head()

# this will show me the data visually, but is not the best programmatical way to solve

16064     1985-03-01
406358    1985-03-11
346216    1985-03-20
35527     1985-03-23
277603    1985-04-17
Name: to_date, dtype: object

9. What is the most recent date in the to_date column?

In [34]:
# let's find the to_date column in the titles_df and sort it
titles_df['to_date'].sort_values(ascending=False).head()

# this will show me the data visually, but is not the best programmatical way to solve

443307    9999-01-01
191723    9999-01-01
191707    9999-01-01
191712    9999-01-01
191714    9999-01-01
Name: to_date, dtype: object

In [ ]:
# what if I wanted the most recent, who is not a current employee?

Exercises II

1. Copy the users and roles DataFrames from the examples above.#

2. What is the result of using a right join on the DataFrames?

3. What is the result of using an outer join on the DataFrames?

4. What happens if you drop the foreign keys from the DataFrames and try to merge them?

5. Load the mpg dataset from PyDataset.

6. Output and read the documentation for the mpg dataset.

7. How many rows and columns are in the dataset?

8. Check out your column names and perform any cleanup you may want on them.

9. Display the summary statistics for the dataset.

10. How many different manufacturers are there?

11. How many different models are there?

12. Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

13. Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

14. Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

15. Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

16. Do automatic or manual cars have better miles per gallon?

Exercises III

1. Use your get_db_url function to help you explore the data from the chipotle database.

2. What is the total price for each order?

3. What are the most popular 3 items?

4. Which item has produced the most revenue?

5. Using the titles DataFrame, visualize the number of employees with each title.

6. Join the employees and titles DataFrames together.

7. Visualize how frequently employees change titles.

8. For each title, find the hire date of the employee that was hired most recently with that title.

9. Write the code necessary to create a cross tabulation of the number of titles by department. (Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)